garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1777.PIC
        <edc:SFRDef edc:access="----nnnn" edc:cname="CM1PSEL" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="CM1PSEL" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-01295_cmp_rr_v6_F177x.Module.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x115">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCH" edc:desc="" edc:mask="0xf" edc:name="PCH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="PCH0" edc:desc="" edc:mask="0x1" edc:name="PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH1" edc:desc="" edc:mask="0x1" edc:name="PCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH2" edc:desc="" edc:mask="0x1" edc:name="PCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH3" edc:desc="" edc:mask="0x1" edc:name="PCH3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C1PCH" edc:desc="" edc:mask="0xf" edc:name="C1PCH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="C1PCH0" edc:desc="" edc:mask="0x1" edc:name="C1PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1PCH1" edc:desc="" edc:mask="0x1" edc:name="C1PCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1PCH2" edc:desc="" edc:mask="0x1" edc:name="C1PCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1PCH3" edc:desc="" edc:mask="0x1" edc:name="C1PCH3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nr-nn-nn" edc:cname="CM2CON0" edc:desc="" edc:impl="0xdb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-00-00" edc:name="CM2CON0" edc:nzwidth="8" edc:por="00-00-00" edc:_modsrc="DOS-01295_cmp_rr_v6_F177x.Module.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x116">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SYNC" edc:desc="" edc:mask="0x1" edc:name="SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HYS" edc:desc="" edc:mask="0x1" edc:name="HYS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ZLF" edc:desc="" edc:mask="0x1" edc:name="ZLF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C2SYNC" edc:desc="" edc:mask="0x1" edc:name="C2SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2HYS" edc:desc="" edc:mask="0x1" edc:name="C2HYS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C2ZLF" edc:desc="" edc:mask="0x1" edc:name="C2ZLF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2POL" edc:desc="" edc:mask="0x1" edc:name="C2POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C2OUT" edc:desc="" edc:mask="0x1" edc:name="C2OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2ON" edc:desc="" edc:mask="0x1" edc:name="C2ON" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------nn" edc:cname="CM2CON1" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="CM2CON1" edc:nzwidth="8" edc:por="------00" edc:_modsrc="DOS-01295_cmp_rr_v6_F177x.Module.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x117">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INTN" edc:desc="" edc:mask="0x1" edc:name="INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INTP" edc:desc="" edc:mask="0x1" edc:name="INTP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C2INTN" edc:desc="" edc:mask="0x1" edc:name="C2INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2INTP" edc:desc="" edc:mask="0x1" edc:name="C2INTP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="CM2NSEL" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="CM2NSEL" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-01295_cmp_rr_v6_F177x.Module.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x118">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NCH" edc:desc="" edc:mask="0xf" edc:name="NCH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C2NCH" edc:desc="" edc:mask="0xf" edc:name="C2NCH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="C2NCH0" edc:desc="" edc:mask="0x1" edc:name="C2NCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2NCH1" edc:desc="" edc:mask="0x1" edc:name="C2NCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2NCH2" edc:desc="" edc:mask="0x1" edc:name="C2NCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2NCH3" edc:mask="0x1" edc:name="C2NCH3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="CM2PSEL" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="CM2PSEL" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-01295_cmp_rr_v6_F177x.Module.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x119">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCH" edc:desc="" edc:mask="0xf" edc:name="PCH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="PCH0" edc:desc="" edc:mask="0x1" edc:name="PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH1" edc:desc="" edc:mask="0x1" edc:name="PCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH2" edc:desc="" edc:mask="0x1" edc:name="PCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH3" edc:desc="" edc:mask="0x1" edc:name="PCH3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C2PCH" edc:desc="" edc:mask="0xf" edc:name="C2PCH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="C2PCH0" edc:desc="" edc:mask="0x1" edc:name="C2PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2PCH1" edc:desc="" edc:mask="0x1" edc:name="C2PCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2PCH2" edc:desc="" edc:mask="0x1" edc:name="C2PCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2PCH3" edc:desc="" edc:mask="0x1" edc:name="C2PCH3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nr-nn-nn" edc:cname="CM3CON0" edc:desc="" edc:impl="0xdb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-00-00" edc:name="CM3CON0" edc:nzwidth="8" edc:por="00-00-00" edc:_modsrc="DOS-01295_cmp_rr_v6_F177x.Module.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x11A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SYNC" edc:desc="" edc:mask="0x1" edc:name="SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HYS" edc:desc="" edc:mask="0x1" edc:name="HYS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ZLF" edc:desc="" edc:mask="0x1" edc:name="ZLF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C3SYNC" edc:desc="" edc:mask="0x1" edc:name="C3SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3HYS" edc:desc="" edc:mask="0x1" edc:name="C3HYS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C3ZLF" edc:desc="" edc:mask="0x1" edc:name="C3ZLF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3POL" edc:desc="" edc:mask="0x1" edc:name="C3POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C3OUT" edc:desc="" edc:mask="0x1" edc:name="C3OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3ON" edc:desc="" edc:mask="0x1" edc:name="C3ON" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------nn" edc:cname="CM3CON1" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="CM3CON1" edc:nzwidth="8" edc:por="------00" edc:_modsrc="DOS-01295_cmp_rr_v6_F177x.Module.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x11B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INTN" edc:desc="" edc:mask="0x1" edc:name="INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INTP" edc:desc="" edc:mask="0x1" edc:name="INTP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C3INTN" edc:desc="" edc:mask="0x1" edc:name="C3INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3INTP" edc:desc="" edc:mask="0x1" edc:name="C3INTP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="CM3NSEL" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="CM3NSEL" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-01295_cmp_rr_v6_F177x.Module.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x11C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NCH" edc:desc="" edc:mask="0xf" edc:name="NCH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C3NCH" edc:desc="" edc:mask="0xf" edc:name="C3NCH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="C3NCH0" edc:desc="" edc:mask="0x1" edc:name="C3NCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3NCH1" edc:desc="" edc:mask="0x1" edc:name="C3NCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3NCH2" edc:desc="" edc:mask="0x1" edc:name="C3NCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3NCH3" edc:mask="0x1" edc:name="C3NCH3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="CM3PSEL" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="CM3PSEL" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-01295_cmp_rr_v6_F177x.Module.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x11D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCH" edc:desc="" edc:mask="0xf" edc:name="PCH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="PCH0" edc:desc="" edc:mask="0x1" edc:name="PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH1" edc:desc="" edc:mask="0x1" edc:name="PCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH2" edc:desc="" edc:mask="0x1" edc:name="PCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH3" edc:desc="" edc:mask="0x1" edc:name="PCH3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C3PCH" edc:desc="" edc:mask="0xf" edc:name="C3PCH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="C3PCH0" edc:desc="" edc:mask="0x1" edc:name="C3PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3PCH1" edc:desc="" edc:mask="0x1" edc:name="C3PCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3PCH2" edc:desc="" edc:mask="0x1" edc:name="C3PCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3PCH3" edc:desc="" edc:mask="0x1" edc:name="C3PCH3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
