garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1777.PIC
        <edc:SFRDef edc:access="----nnnn" edc:cname="WPUE" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----1111" edc:name="WPUE" edc:nzwidth="8" edc:por="----1111" edc:_addr="0x210">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WPUE0" edc:mask="0x1" edc:name="WPUE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUE1" edc:mask="0x1" edc:name="WPUE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUE2" edc:mask="0x1" edc:name="WPUE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUE3" edc:mask="0x1" edc:name="WPUE3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SSP1BUF" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="SSP1BUF" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-01215_mssp_v7.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x211">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="SSPBUF"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SSP1BUF0" edc:desc="" edc:mask="0x1" edc:name="SSP1BUF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1BUF1" edc:desc="" edc:mask="0x1" edc:name="SSP1BUF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1BUF2" edc:desc="" edc:mask="0x1" edc:name="SSP1BUF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1BUF3" edc:desc="" edc:mask="0x1" edc:name="SSP1BUF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1BUF4" edc:desc="" edc:mask="0x1" edc:name="SSP1BUF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1BUF5" edc:desc="" edc:mask="0x1" edc:name="SSP1BUF5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1BUF6" edc:desc="" edc:mask="0x1" edc:name="SSP1BUF6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1BUF7" edc:desc="" edc:mask="0x1" edc:name="SSP1BUF7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BUF" edc:desc="" edc:mask="0xff" edc:name="BUF" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="BUF0" edc:desc="" edc:mask="0x1" edc:name="BUF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BUF1" edc:desc="" edc:mask="0x1" edc:name="BUF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BUF2" edc:desc="" edc:mask="0x1" edc:name="BUF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BUF3" edc:desc="" edc:mask="0x1" edc:name="BUF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BUF4" edc:desc="" edc:mask="0x1" edc:name="BUF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BUF5" edc:desc="" edc:mask="0x1" edc:name="BUF5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BUF6" edc:desc="" edc:mask="0x1" edc:name="BUF6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BUF7" edc:desc="" edc:mask="0x1" edc:name="BUF7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SSP1BUF" edc:desc="" edc:mask="0xff" edc:name="SSP1BUF" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SSP1ADD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SSP1ADD" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-01215_mssp_v7.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x212">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="SSPADD"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SSP1ADD0" edc:desc="" edc:mask="0x1" edc:name="SSP1ADD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1ADD1" edc:desc="" edc:mask="0x1" edc:name="SSP1ADD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1ADD2" edc:desc="" edc:mask="0x1" edc:name="SSP1ADD2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1ADD3" edc:desc="" edc:mask="0x1" edc:name="SSP1ADD3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1ADD4" edc:desc="" edc:mask="0x1" edc:name="SSP1ADD4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1ADD5" edc:desc="" edc:mask="0x1" edc:name="SSP1ADD5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1ADD6" edc:desc="" edc:mask="0x1" edc:name="SSP1ADD6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1ADD7" edc:desc="" edc:mask="0x1" edc:name="SSP1ADD7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADD" edc:desc="" edc:mask="0xff" edc:name="ADD" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADD0" edc:desc="" edc:mask="0x1" edc:name="ADD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADD1" edc:desc="" edc:mask="0x1" edc:name="ADD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADD2" edc:desc="" edc:mask="0x1" edc:name="ADD2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADD3" edc:desc="" edc:mask="0x1" edc:name="ADD3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADD4" edc:desc="" edc:mask="0x1" edc:name="ADD4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADD5" edc:desc="" edc:mask="0x1" edc:name="ADD5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADD6" edc:desc="" edc:mask="0x1" edc:name="ADD6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADD7" edc:desc="" edc:mask="0x1" edc:name="ADD7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SSP1ADD" edc:desc="" edc:mask="0xff" edc:name="SSP1ADD" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SSP1MSK" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="SSP1MSK" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-01215_mssp_v7.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x213">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="SSPMSK"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SSP1MSK0" edc:desc="" edc:mask="0x1" edc:name="SSP1MSK0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1MSK1" edc:desc="" edc:mask="0x1" edc:name="SSP1MSK1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1MSK2" edc:desc="" edc:mask="0x1" edc:name="SSP1MSK2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1MSK3" edc:desc="" edc:mask="0x1" edc:name="SSP1MSK3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1MSK4" edc:desc="" edc:mask="0x1" edc:name="SSP1MSK4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1MSK5" edc:desc="" edc:mask="0x1" edc:name="SSP1MSK5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1MSK6" edc:desc="" edc:mask="0x1" edc:name="SSP1MSK6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1MSK7" edc:desc="" edc:mask="0x1" edc:name="SSP1MSK7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MSK" edc:desc="" edc:mask="0xff" edc:name="MSK" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MSK0" edc:desc="" edc:mask="0x1" edc:name="MSK0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSK1" edc:desc="" edc:mask="0x1" edc:name="MSK1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSK2" edc:desc="" edc:mask="0x1" edc:name="MSK2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSK3" edc:desc="" edc:mask="0x1" edc:name="MSK3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSK4" edc:desc="" edc:mask="0x1" edc:name="MSK4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSK5" edc:desc="" edc:mask="0x1" edc:name="MSK5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSK6" edc:desc="" edc:mask="0x1" edc:name="MSK6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSK7" edc:desc="" edc:mask="0x1" edc:name="MSK7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SSP1MSK" edc:desc="" edc:mask="0xff" edc:name="SSP1MSK" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnrrrrrr" edc:cname="SSP1STAT" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SSP1STAT" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-01215_mssp_v7.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x214">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="SSPSTAT"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BF" edc:desc="" edc:mask="0x1" edc:name="BF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="UA" edc:desc="" edc:mask="0x1" edc:name="UA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="R_nW" edc:desc="" edc:mask="0x1" edc:name="R_nW" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S" edc:desc="" edc:mask="0x1" edc:name="S" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P" edc:desc="" edc:mask="0x1" edc:name="P" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D_nA" edc:desc="" edc:mask="0x1" edc:name="D_nA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKE" edc:desc="" edc:mask="0x1" edc:name="CKE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMP" edc:desc="" edc:mask="0x1" edc:name="SMP" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
