garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1777.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T8HLT" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="T8HLT" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02777_tmr_mid2_v2_F177x.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x49D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x1f" edc:name="MODE" edc:nzwidth="5"/>
              <edc:SFRFieldDef edc:cname="CKSYNC" edc:desc="" edc:mask="0x1" edc:name="CKSYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPOL" edc:desc="" edc:mask="0x1" edc:name="CKPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSYNC" edc:desc="" edc:mask="0x1" edc:name="PSYNC" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:desc="" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE3" edc:desc="" edc:mask="0x1" edc:name="MODE3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE4" edc:desc="" edc:mask="0x1" edc:name="MODE4" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T8MODE" edc:desc="" edc:mask="0x1f" edc:name="T8MODE" edc:nzwidth="5"/>
              <edc:SFRFieldDef edc:cname="T8CKSYNC" edc:desc="" edc:mask="0x1" edc:name="T8CKSYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T8CKPOL" edc:desc="" edc:mask="0x1" edc:name="T8CKPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T8PSYNC" edc:desc="" edc:mask="0x1" edc:name="T8PSYNC" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T8MODE0" edc:desc="" edc:mask="0x1" edc:name="T8MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T8MODE1" edc:desc="" edc:mask="0x1" edc:name="T8MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T8MODE2" edc:desc="" edc:mask="0x1" edc:name="T8MODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T8MODE3" edc:desc="" edc:mask="0x1" edc:name="T8MODE3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T8MODE4" edc:desc="" edc:mask="0x1" edc:name="T8MODE4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="T8CLKCON" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="T8CLKCON" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02777_tmr_mid2_v2_F177x.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x49E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CS" edc:desc="" edc:mask="0xf" edc:name="CS" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CS0" edc:desc="" edc:mask="0x1" edc:name="CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CS1" edc:desc="" edc:mask="0x1" edc:name="CS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CS2" edc:desc="" edc:mask="0x1" edc:name="CS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CS3" edc:desc="" edc:mask="0x1" edc:name="CS3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T8CS" edc:desc="" edc:mask="0xf" edc:name="T8CS" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T8CS0" edc:desc="" edc:mask="0x1" edc:name="T8CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T8CS1" edc:desc="" edc:mask="0x1" edc:name="T8CS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T8CS2" edc:desc="" edc:mask="0x1" edc:name="T8CS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T8CS3" edc:desc="" edc:mask="0x1" edc:name="T8CS3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T8RST" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---x0000" edc:name="T8RST" edc:nzwidth="8" edc:por="---x0000" edc:_modsrc="DOS-02777_tmr_mid2_v2_F177x.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x49F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RSEL" edc:desc="" edc:mask="0x1f" edc:name="RSEL" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="RSEL0" edc:desc="" edc:mask="0x1" edc:name="RSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSEL1" edc:desc="" edc:mask="0x1" edc:name="RSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSEL2" edc:desc="" edc:mask="0x1" edc:name="RSEL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSEL3" edc:desc="" edc:mask="0x1" edc:name="RSEL3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSEL4" edc:desc="" edc:mask="0x1" edc:name="RSEL4" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T8RSEL" edc:desc="" edc:mask="0x1f" edc:name="T8RSEL" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T8RSEL0" edc:desc="" edc:mask="0x1" edc:name="T8RSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T8RSEL1" edc:desc="" edc:mask="0x1" edc:name="T8RSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T8RSEL2" edc:desc="" edc:mask="0x1" edc:name="T8RSEL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T8RSEL3" edc:desc="" edc:mask="0x1" edc:name="T8RSEL3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T8RSEL4" edc:desc="" edc:mask="0x1" edc:name="T8RSEL4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="10" edc:beginaddr="0x500" edc:endaddr="0x520" edc:regionid="sfr10">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x500"/>
        <edc:AdjustPoint edc:offset="3" edc:_addr="0x50C"/>
        <edc:SFRDef edc:access="----nnnn" edc:cname="OPA1NCHS" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="OPA1NCHS" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02418_amp_opamp_hvpump_v2_F176x.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x50F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NCH" edc:desc="" edc:mask="0xf" edc:name="NCH" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="OPA1NCH" edc:desc="" edc:mask="0xf" edc:name="OPA1NCH" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
