garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1777.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM9DCH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM9DCH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02719_pwm_10bit_v3_8Bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x61B">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0xff" edc:name="DC" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.1">
                <edc:SFRFieldDef edc:cname="DC2" edc:desc="" edc:mask="0x1" edc:name="DC2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC3" edc:desc="" edc:mask="0x1" edc:name="DC3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC4" edc:desc="" edc:mask="0x1" edc:name="DC4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC5" edc:desc="" edc:mask="0x1" edc:name="DC5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC6" edc:desc="" edc:mask="0x1" edc:name="DC6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC7" edc:desc="" edc:mask="0x1" edc:name="DC7" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC8" edc:desc="" edc:mask="0x1" edc:name="DC8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC9" edc:desc="" edc:mask="0x1" edc:name="DC9" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM9DC2" edc:desc="" edc:mask="0x1" edc:name="PWM9DC2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM9DC3" edc:desc="" edc:mask="0x1" edc:name="PWM9DC3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM9DC4" edc:desc="" edc:mask="0x1" edc:name="PWM9DC4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM9DC5" edc:desc="" edc:mask="0x1" edc:name="PWM9DC5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM9DC6" edc:desc="" edc:mask="0x1" edc:name="PWM9DC6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM9DC7" edc:desc="" edc:mask="0x1" edc:name="PWM9DC7" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM9DC8" edc:desc="" edc:mask="0x1" edc:name="PWM9DC8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM9DC9" edc:desc="" edc:mask="0x1" edc:name="PWM9DC9" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWMPW2" edc:mask="0x1" edc:name="PWMPW2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW3" edc:mask="0x1" edc:name="PWMPW3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW4" edc:mask="0x1" edc:name="PWMPW4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW5" edc:mask="0x1" edc:name="PWMPW5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW6" edc:mask="0x1" edc:name="PWMPW6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW7" edc:mask="0x1" edc:name="PWMPW7" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW8" edc:mask="0x1" edc:name="PWMPW8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW9" edc:mask="0x1" edc:name="PWMPW9" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="n-rn----" edc:cname="PWM9CON" edc:desc="" edc:impl="0xb0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-00----" edc:name="PWM9CON" edc:nzwidth="8" edc:por="0-00----" edc:_modsrc="DOS-02719_pwm_10bit_v3_8Bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x61C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="PWM9POL" edc:desc="" edc:mask="0x1" edc:name="PWM9POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM9OUT" edc:desc="" edc:mask="0x1" edc:name="PWM9OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM9EN" edc:desc="" edc:mask="0x1" edc:name="PWM9EN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="PWM10DC" edc:desc="" edc:name="PWM10DC" edc:nzwidth="0x10" edc:_modsrc="DOS-02719_pwm_10bit_v3_8Bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x61D">
          <edc:SFRDef edc:access="nn------" edc:cname="PWM10DCL" edc:desc="" edc:impl="0xc0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu------" edc:name="PWM10DCL" edc:nzwidth="8" edc:por="xx------" edc:_modsrc="DOS-02719_pwm_10bit_v3_8Bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x61D">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:AdjustPoint edc:offset="6"/>
                <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0x3" edc:name="DC" edc:nzwidth="2"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.1">
                <edc:AdjustPoint edc:offset="6"/>
                <edc:SFRFieldDef edc:cname="DC0" edc:desc="" edc:mask="0x1" edc:name="DC0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC1" edc:desc="" edc:mask="0x1" edc:name="DC1" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:AdjustPoint edc:offset="6"/>
                <edc:SFRFieldDef edc:cname="PWM10DC0" edc:desc="" edc:mask="0x1" edc:name="PWM10DC0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM10DC1" edc:desc="" edc:mask="0x1" edc:name="PWM10DC1" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:AdjustPoint edc:offset="0x6"/>
                <edc:SFRFieldDef edc:cname="PWMPW0" edc:mask="0x1" edc:name="PWMPW0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW1" edc:mask="0x1" edc:name="PWMPW1" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM10DCH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM10DCH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02719_pwm_10bit_v3_8Bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x61E">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0xff" edc:name="DC" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.1">
                <edc:SFRFieldDef edc:cname="DC2" edc:desc="" edc:mask="0x1" edc:name="DC2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC3" edc:desc="" edc:mask="0x1" edc:name="DC3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC4" edc:desc="" edc:mask="0x1" edc:name="DC4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC5" edc:desc="" edc:mask="0x1" edc:name="DC5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC6" edc:desc="" edc:mask="0x1" edc:name="DC6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC7" edc:desc="" edc:mask="0x1" edc:name="DC7" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC8" edc:desc="" edc:mask="0x1" edc:name="DC8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC9" edc:desc="" edc:mask="0x1" edc:name="DC9" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM10DC2" edc:desc="" edc:mask="0x1" edc:name="PWM10DC2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM10DC3" edc:desc="" edc:mask="0x1" edc:name="PWM10DC3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM10DC4" edc:desc="" edc:mask="0x1" edc:name="PWM10DC4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM10DC5" edc:desc="" edc:mask="0x1" edc:name="PWM10DC5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM10DC6" edc:desc="" edc:mask="0x1" edc:name="PWM10DC6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM10DC7" edc:desc="" edc:mask="0x1" edc:name="PWM10DC7" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM10DC8" edc:desc="" edc:mask="0x1" edc:name="PWM10DC8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM10DC9" edc:desc="" edc:mask="0x1" edc:name="PWM10DC9" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWMPW2" edc:mask="0x1" edc:name="PWMPW2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW3" edc:mask="0x1" edc:name="PWMPW3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW4" edc:mask="0x1" edc:name="PWMPW4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW5" edc:mask="0x1" edc:name="PWMPW5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW6" edc:mask="0x1" edc:name="PWMPW6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW7" edc:mask="0x1" edc:name="PWMPW7" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW8" edc:mask="0x1" edc:name="PWMPW8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW9" edc:mask="0x1" edc:name="PWMPW9" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="n-rn----" edc:cname="PWM10CON" edc:desc="" edc:impl="0xb0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-00----" edc:name="PWM10CON" edc:nzwidth="8" edc:por="0-00----" edc:_modsrc="DOS-02719_pwm_10bit_v3_8Bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x61F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="PWM10POL" edc:desc="" edc:mask="0x1" edc:name="PWM10POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM10OUT" edc:desc="" edc:mask="0x1" edc:name="PWM10OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM10EN" edc:desc="" edc:mask="0x1" edc:name="PWM10EN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="13" edc:beginaddr="0x680" edc:endaddr="0x6A0" edc:regionid="sfr13">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x680"/>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x68C"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG1PHR" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="COG1PHR" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x68D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PHR" edc:desc="" edc:mask="0x3f" edc:name="PHR" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="PHR0" edc:desc="" edc:mask="0x1" edc:name="PHR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHR1" edc:desc="" edc:mask="0x1" edc:name="PHR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHR2" edc:desc="" edc:mask="0x1" edc:name="PHR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHR3" edc:desc="" edc:mask="0x1" edc:name="PHR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHR4" edc:desc="" edc:mask="0x1" edc:name="PHR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHR5" edc:desc="" edc:mask="0x1" edc:name="PHR5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1PHR0" edc:desc="" edc:mask="0x1" edc:name="G1PHR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PHR1" edc:desc="" edc:mask="0x1" edc:name="G1PHR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PHR2" edc:desc="" edc:mask="0x1" edc:name="G1PHR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PHR3" edc:desc="" edc:mask="0x1" edc:name="G1PHR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PHR4" edc:desc="" edc:mask="0x1" edc:name="G1PHR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PHR5" edc:desc="" edc:mask="0x1" edc:name="G1PHR5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG1PHF" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="COG1PHF" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x68E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PHF" edc:desc="" edc:mask="0x3f" edc:name="PHF" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="PHF0" edc:desc="" edc:mask="0x1" edc:name="PHF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHF1" edc:desc="" edc:mask="0x1" edc:name="PHF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHF2" edc:desc="" edc:mask="0x1" edc:name="PHF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHF3" edc:desc="" edc:mask="0x1" edc:name="PHF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHF4" edc:desc="" edc:mask="0x1" edc:name="PHF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHF5" edc:desc="" edc:mask="0x1" edc:name="PHF5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1PHF0" edc:desc="" edc:mask="0x1" edc:name="G1PHF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PHF1" edc:desc="" edc:mask="0x1" edc:name="G1PHF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PHF2" edc:desc="" edc:mask="0x1" edc:name="G1PHF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PHF3" edc:desc="" edc:mask="0x1" edc:name="G1PHF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PHF4" edc:desc="" edc:mask="0x1" edc:name="G1PHF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PHF5" edc:desc="" edc:mask="0x1" edc:name="G1PHF5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG1BLKR" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="COG1BLKR" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x68F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BLKR" edc:desc="" edc:mask="0x3f" edc:name="BLKR" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="BLKR0" edc:desc="" edc:mask="0x1" edc:name="BLKR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKR1" edc:desc="" edc:mask="0x1" edc:name="BLKR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKR2" edc:desc="" edc:mask="0x1" edc:name="BLKR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKR3" edc:desc="" edc:mask="0x1" edc:name="BLKR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKR4" edc:desc="" edc:mask="0x1" edc:name="BLKR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKR5" edc:desc="" edc:mask="0x1" edc:name="BLKR5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1BLKR0" edc:desc="" edc:mask="0x1" edc:name="G1BLKR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKR1" edc:desc="" edc:mask="0x1" edc:name="G1BLKR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKR2" edc:desc="" edc:mask="0x1" edc:name="G1BLKR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKR3" edc:desc="" edc:mask="0x1" edc:name="G1BLKR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKR4" edc:desc="" edc:mask="0x1" edc:name="G1BLKR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKR5" edc:desc="" edc:mask="0x1" edc:name="G1BLKR5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG1BLKF" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="COG1BLKF" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x690">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BLKF" edc:desc="" edc:mask="0x3f" edc:name="BLKF" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="BLKF0" edc:desc="" edc:mask="0x1" edc:name="BLKF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKF1" edc:desc="" edc:mask="0x1" edc:name="BLKF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKF2" edc:desc="" edc:mask="0x1" edc:name="BLKF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKF3" edc:desc="" edc:mask="0x1" edc:name="BLKF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKF4" edc:desc="" edc:mask="0x1" edc:name="BLKF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKF5" edc:desc="" edc:mask="0x1" edc:name="BLKF5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1BLKF0" edc:desc="" edc:mask="0x1" edc:name="G1BLKF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKF1" edc:desc="" edc:mask="0x1" edc:name="G1BLKF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKF2" edc:desc="" edc:mask="0x1" edc:name="G1BLKF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKF3" edc:desc="" edc:mask="0x1" edc:name="G1BLKF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKF4" edc:desc="" edc:mask="0x1" edc:name="G1BLKF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKF5" edc:desc="" edc:mask="0x1" edc:name="G1BLKF5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG1DBR" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="COG1DBR" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x691">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DBR" edc:desc="" edc:mask="0x3f" edc:name="DBR" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="DBR0" edc:desc="" edc:mask="0x1" edc:name="DBR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR1" edc:desc="" edc:mask="0x1" edc:name="DBR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR2" edc:desc="" edc:mask="0x1" edc:name="DBR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR3" edc:desc="" edc:mask="0x1" edc:name="DBR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR4" edc:desc="" edc:mask="0x1" edc:name="DBR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR5" edc:desc="" edc:mask="0x1" edc:name="DBR5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1DBR0" edc:desc="" edc:mask="0x1" edc:name="G1DBR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBR1" edc:desc="" edc:mask="0x1" edc:name="G1DBR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBR2" edc:desc="" edc:mask="0x1" edc:name="G1DBR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBR3" edc:desc="" edc:mask="0x1" edc:name="G1DBR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBR4" edc:desc="" edc:mask="0x1" edc:name="G1DBR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBR5" edc:desc="" edc:mask="0x1" edc:name="G1DBR5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
