garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1777.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG3STR" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG3STR" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x81F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STRA" edc:desc="" edc:mask="0x1" edc:name="STRA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRB" edc:desc="" edc:mask="0x1" edc:name="STRB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRC" edc:desc="" edc:mask="0x1" edc:name="STRC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRD" edc:desc="" edc:mask="0x1" edc:name="STRD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDATA" edc:desc="" edc:mask="0x1" edc:name="SDATA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDATB" edc:desc="" edc:mask="0x1" edc:name="SDATB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDATC" edc:desc="" edc:mask="0x1" edc:name="SDATC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDATD" edc:desc="" edc:mask="0x1" edc:name="SDATD" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G3STRA" edc:desc="" edc:mask="0x1" edc:name="G3STRA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3STRB" edc:desc="" edc:mask="0x1" edc:name="G3STRB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3STRC" edc:desc="" edc:mask="0x1" edc:name="G3STRC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3STRD" edc:desc="" edc:mask="0x1" edc:name="G3STRD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3SDATA" edc:desc="" edc:mask="0x1" edc:name="G3SDATA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3SDATB" edc:desc="" edc:mask="0x1" edc:name="G3SDATB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3SDATC" edc:desc="" edc:mask="0x1" edc:name="G3SDATC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3SDATD" edc:desc="" edc:mask="0x1" edc:name="G3SDATD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="17" edc:beginaddr="0x880" edc:endaddr="0x8a0" edc:regionid="sfr17">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x880"/>
        <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x88C"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG4PHR" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="COG4PHR" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x88D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PHR" edc:desc="" edc:mask="0x3f" edc:name="PHR" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="PHR0" edc:desc="" edc:mask="0x1" edc:name="PHR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHR1" edc:desc="" edc:mask="0x1" edc:name="PHR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHR2" edc:desc="" edc:mask="0x1" edc:name="PHR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHR3" edc:desc="" edc:mask="0x1" edc:name="PHR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHR4" edc:desc="" edc:mask="0x1" edc:name="PHR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHR5" edc:desc="" edc:mask="0x1" edc:name="PHR5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G4PHR0" edc:desc="" edc:mask="0x1" edc:name="G4PHR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4PHR1" edc:desc="" edc:mask="0x1" edc:name="G4PHR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4PHR2" edc:desc="" edc:mask="0x1" edc:name="G4PHR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4PHR3" edc:desc="" edc:mask="0x1" edc:name="G4PHR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4PHR4" edc:desc="" edc:mask="0x1" edc:name="G4PHR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4PHR5" edc:desc="" edc:mask="0x1" edc:name="G4PHR5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG4PHF" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="COG4PHF" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x88E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PHF" edc:desc="" edc:mask="0x3f" edc:name="PHF" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="PHF0" edc:desc="" edc:mask="0x1" edc:name="PHF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHF1" edc:desc="" edc:mask="0x1" edc:name="PHF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHF2" edc:desc="" edc:mask="0x1" edc:name="PHF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHF3" edc:desc="" edc:mask="0x1" edc:name="PHF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHF4" edc:desc="" edc:mask="0x1" edc:name="PHF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHF5" edc:desc="" edc:mask="0x1" edc:name="PHF5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G4PHF0" edc:desc="" edc:mask="0x1" edc:name="G4PHF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4PHF1" edc:desc="" edc:mask="0x1" edc:name="G4PHF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4PHF2" edc:desc="" edc:mask="0x1" edc:name="G4PHF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4PHF3" edc:desc="" edc:mask="0x1" edc:name="G4PHF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4PHF4" edc:desc="" edc:mask="0x1" edc:name="G4PHF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4PHF5" edc:desc="" edc:mask="0x1" edc:name="G4PHF5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG4BLKR" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="COG4BLKR" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x88F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BLKR" edc:desc="" edc:mask="0x3f" edc:name="BLKR" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="BLKR0" edc:desc="" edc:mask="0x1" edc:name="BLKR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKR1" edc:desc="" edc:mask="0x1" edc:name="BLKR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKR2" edc:desc="" edc:mask="0x1" edc:name="BLKR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKR3" edc:desc="" edc:mask="0x1" edc:name="BLKR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKR4" edc:desc="" edc:mask="0x1" edc:name="BLKR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKR5" edc:desc="" edc:mask="0x1" edc:name="BLKR5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G4BLKR0" edc:desc="" edc:mask="0x1" edc:name="G4BLKR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4BLKR1" edc:desc="" edc:mask="0x1" edc:name="G4BLKR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4BLKR2" edc:desc="" edc:mask="0x1" edc:name="G4BLKR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4BLKR3" edc:desc="" edc:mask="0x1" edc:name="G4BLKR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4BLKR4" edc:desc="" edc:mask="0x1" edc:name="G4BLKR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4BLKR5" edc:desc="" edc:mask="0x1" edc:name="G4BLKR5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
