garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1777.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG4BLKF" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="COG4BLKF" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x890">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BLKF" edc:desc="" edc:mask="0x3f" edc:name="BLKF" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="BLKF0" edc:desc="" edc:mask="0x1" edc:name="BLKF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKF1" edc:desc="" edc:mask="0x1" edc:name="BLKF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKF2" edc:desc="" edc:mask="0x1" edc:name="BLKF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKF3" edc:desc="" edc:mask="0x1" edc:name="BLKF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKF4" edc:desc="" edc:mask="0x1" edc:name="BLKF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKF5" edc:desc="" edc:mask="0x1" edc:name="BLKF5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G4BLKF0" edc:desc="" edc:mask="0x1" edc:name="G4BLKF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4BLKF1" edc:desc="" edc:mask="0x1" edc:name="G4BLKF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4BLKF2" edc:desc="" edc:mask="0x1" edc:name="G4BLKF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4BLKF3" edc:desc="" edc:mask="0x1" edc:name="G4BLKF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4BLKF4" edc:desc="" edc:mask="0x1" edc:name="G4BLKF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4BLKF5" edc:desc="" edc:mask="0x1" edc:name="G4BLKF5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG4DBR" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="COG4DBR" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x891">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DBR" edc:desc="" edc:mask="0x3f" edc:name="DBR" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="DBR0" edc:desc="" edc:mask="0x1" edc:name="DBR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR1" edc:desc="" edc:mask="0x1" edc:name="DBR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR2" edc:desc="" edc:mask="0x1" edc:name="DBR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR3" edc:desc="" edc:mask="0x1" edc:name="DBR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR4" edc:desc="" edc:mask="0x1" edc:name="DBR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR5" edc:desc="" edc:mask="0x1" edc:name="DBR5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G4DBR0" edc:desc="" edc:mask="0x1" edc:name="G4DBR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4DBR1" edc:desc="" edc:mask="0x1" edc:name="G4DBR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4DBR2" edc:desc="" edc:mask="0x1" edc:name="G4DBR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4DBR3" edc:desc="" edc:mask="0x1" edc:name="G4DBR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4DBR4" edc:desc="" edc:mask="0x1" edc:name="G4DBR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4DBR5" edc:desc="" edc:mask="0x1" edc:name="G4DBR5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG4DBF" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="COG4DBF" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x892">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DBF0" edc:desc="" edc:mask="0x1" edc:name="DBF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF1" edc:desc="" edc:mask="0x1" edc:name="DBF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF2" edc:desc="" edc:mask="0x1" edc:name="DBF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF3" edc:desc="" edc:mask="0x1" edc:name="DBF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF4" edc:desc="" edc:mask="0x1" edc:name="DBF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF5" edc:desc="" edc:mask="0x1" edc:name="DBF5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="G4DBF0" edc:desc="" edc:mask="0x1" edc:name="G4DBF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4DBF1" edc:desc="" edc:mask="0x1" edc:name="G4DBF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4DBF2" edc:desc="" edc:mask="0x1" edc:name="G4DBF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4DBF3" edc:desc="" edc:mask="0x1" edc:name="G4DBF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4DBF4" edc:desc="" edc:mask="0x1" edc:name="G4DBF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4DBF5" edc:desc="" edc:mask="0x1" edc:name="G4DBF5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G4DBF" edc:desc="" edc:mask="0x3f" edc:name="G4DBF" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn-nnnnn" edc:cname="COG4CON0" edc:desc="" edc:impl="0xdf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-00000" edc:name="COG4CON0" edc:nzwidth="0x8" edc:por="00-00000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x893">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MD" edc:desc="" edc:mask="0x7" edc:name="MD" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="CS" edc:desc="" edc:mask="0x3" edc:name="CS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LD" edc:desc="" edc:mask="0x1" edc:name="LD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="MD0" edc:desc="" edc:mask="0x1" edc:name="MD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD1" edc:desc="" edc:mask="0x1" edc:name="MD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD2" edc:desc="" edc:mask="0x1" edc:name="MD2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CS0" edc:desc="" edc:mask="0x1" edc:name="CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CS1" edc:desc="" edc:mask="0x1" edc:name="CS1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G4MD" edc:desc="" edc:mask="0x7" edc:name="G4MD" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="G4CS" edc:desc="" edc:mask="0x3" edc:name="G4CS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="G4LD" edc:desc="" edc:mask="0x1" edc:name="G4LD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4EN" edc:desc="" edc:mask="0x1" edc:name="G4EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="G4MD0" edc:desc="" edc:mask="0x1" edc:name="G4MD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4MD1" edc:desc="" edc:mask="0x1" edc:name="G4MD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4MD2" edc:desc="" edc:mask="0x1" edc:name="G4MD2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4CS0" edc:desc="" edc:mask="0x1" edc:name="G4CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4CS1" edc:desc="" edc:mask="0x1" edc:name="G4CS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
