garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1777.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC2GLS1" edc:desc="Gate logic select register 1" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC2GLS1" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF21">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC2G2D1N" edc:desc="" edc:mask="0x1" edc:name="LC2G2D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC2G2D1T" edc:desc="" edc:mask="0x1" edc:name="LC2G2D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC2G2D2N" edc:desc="" edc:mask="0x1" edc:name="LC2G2D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC2G2D2T" edc:desc="" edc:mask="0x1" edc:name="LC2G2D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC2G2D3N" edc:desc="" edc:mask="0x1" edc:name="LC2G2D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC2G2D3T" edc:desc="" edc:mask="0x1" edc:name="LC2G2D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC2G2D4N" edc:desc="" edc:mask="0x1" edc:name="LC2G2D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC2G2D4T" edc:desc="" edc:mask="0x1" edc:name="LC2G2D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="D1N" edc:desc="" edc:mask="0x1" edc:name="D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D1T" edc:desc="" edc:mask="0x1" edc:name="D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D2N" edc:desc="" edc:mask="0x1" edc:name="D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D2T" edc:desc="" edc:mask="0x1" edc:name="D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D3N" edc:desc="" edc:mask="0x1" edc:name="D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D3T" edc:desc="" edc:mask="0x1" edc:name="D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D4N" edc:desc="" edc:mask="0x1" edc:name="D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D4T" edc:desc="" edc:mask="0x1" edc:name="D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC2GLS2" edc:desc="Gate logic select register 2" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC2GLS2" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF22">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC2G3D1N" edc:desc="" edc:mask="0x1" edc:name="LC2G3D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC2G3D1T" edc:desc="" edc:mask="0x1" edc:name="LC2G3D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC2G3D2N" edc:desc="" edc:mask="0x1" edc:name="LC2G3D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC2G3D2T" edc:desc="" edc:mask="0x1" edc:name="LC2G3D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC2G3D3N" edc:desc="" edc:mask="0x1" edc:name="LC2G3D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC2G3D3T" edc:desc="" edc:mask="0x1" edc:name="LC2G3D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC2G3D4N" edc:desc="" edc:mask="0x1" edc:name="LC2G3D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC2G3D4T" edc:desc="" edc:mask="0x1" edc:name="LC2G3D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="D1N" edc:desc="" edc:mask="0x1" edc:name="D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D1T" edc:desc="" edc:mask="0x1" edc:name="D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D2N" edc:desc="" edc:mask="0x1" edc:name="D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D2T" edc:desc="" edc:mask="0x1" edc:name="D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D3N" edc:desc="" edc:mask="0x1" edc:name="D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D3T" edc:desc="" edc:mask="0x1" edc:name="D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D4N" edc:desc="" edc:mask="0x1" edc:name="D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D4T" edc:desc="" edc:mask="0x1" edc:name="D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC2GLS3" edc:desc="Gate logic select register 3" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC2GLS3" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF23">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC2G4D1N" edc:desc="" edc:mask="0x1" edc:name="LC2G4D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC2G4D1T" edc:desc="" edc:mask="0x1" edc:name="LC2G4D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC2G4D2N" edc:desc="" edc:mask="0x1" edc:name="LC2G4D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC2G4D2T" edc:desc="" edc:mask="0x1" edc:name="LC2G4D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC2G4D3N" edc:desc="" edc:mask="0x1" edc:name="LC2G4D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC2G4D3T" edc:desc="" edc:mask="0x1" edc:name="LC2G4D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC2G4D4N" edc:desc="" edc:mask="0x1" edc:name="LC2G4D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC2G4D4T" edc:desc="" edc:mask="0x1" edc:name="LC2G4D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="G4D1N" edc:desc="" edc:mask="0x1" edc:name="G4D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D1T" edc:desc="" edc:mask="0x1" edc:name="G4D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D2N" edc:desc="" edc:mask="0x1" edc:name="G4D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D2T" edc:desc="" edc:mask="0x1" edc:name="G4D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D3N" edc:desc="" edc:mask="0x1" edc:name="G4D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D3T" edc:desc="" edc:mask="0x1" edc:name="G4D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D4N" edc:desc="" edc:mask="0x1" edc:name="G4D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D4T" edc:desc="" edc:mask="0x1" edc:name="G4D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
